qarnet/le-audio-receiver/tests/unit/timing_nrf54/src/test_timing_nrf54.c
/*
 * Copyright (c) 2026
 * SPDX-License-Identifier: Apache-2.0
 *
 * Production nRF54 timing suite.
 *
 * Compiles and executes the real src/audio_timing_nrf54.c and
 * src/audio_timing_math.c against test-owned include shadows of the
 * installed nrfx_grtc / nrfx_gppi / nrf_grtc / nrf_timer HALs (see
 * include/) and a mock of audio_drift_frequency_error_update().
 * No timing algorithm is copied into this suite; the mocks only
 * capture calls, arguments, callbacks, and resource state.
 *
 * The GRTC compare callback is invoked exactly as the driver would:
 * tests fire the handler captured by the mocked
 * nrfx_grtc_channel_callback_set(), then explicitly run the captured
 * deferred work item on the real system workqueue.
 */

#include <zephyr/kernel.h>
#include <zephyr/ztest.h>

#include <errno.h>

#include <hal/nrf_timer.h>

#include "audio_timing.h"
#include "audio_timing_math.h"
#include "mock_drift.h"
#include "mock_hal.h"

/* Test seams compiled into the production file under
 * AUDIO_TIMING_NRF54_TEST (see src/audio_timing_nrf54.c). */
struct k_work *audio_timing_test_take_captured_work(void);
bool audio_timing_test_is_active(void);
uint32_t audio_timing_test_generation(void);
bool audio_timing_test_overflow_fault(void);
void audio_timing_test_state_reset(void);

/* Work synchronization object must be cache-coherent and static. */
static struct k_work_sync work_sync;

static void reset_before_each(void *unused)
{
	ARG_UNUSED(unused);
	mock_hal_reset();
	mock_drift_reset();
	audio_timing_test_state_reset();
}

ZTEST_SUITE(timing_nrf54, NULL, NULL, reset_before_each, NULL, NULL);

/* ── Helpers ─────────────────────────────────────────────────────── */

static void init_ok(void)
{
	zassert_equal(audio_timing_init(), 0, "init succeeds");
}

static void fire_cc(uint64_t cc_value)
{
	zassert_not_null(mock_grtc_cb_handler, "GRTC cc callback must be registered");
	mock_grtc_cb_handler(0, cc_value, NULL);
}

static void run_captured_work(void)
{
	struct k_work *work = audio_timing_test_take_captured_work();

	zassert_not_null(work, "diag work must have been submitted");
	zassert_equal(k_work_submit(work), 1, "captured work queued");
	k_work_flush(work, &work_sync);
}

static int log_count(enum mock_event ev)
{
	int n = 0;

	for (int i = 0; i < mock_hal_log_len(); i++) {
		if (mock_hal_log_ev(i) == ev) {
			n++;
		}
	}
	return n;
}

static int log_first(enum mock_event ev)
{
	for (int i = 0; i < mock_hal_log_len(); i++) {
		if (mock_hal_log_ev(i) == ev) {
			return i;
		}
	}
	return -1;
}

/* ── 1. GRTC allocation failure ──────────────────────────────────── */

ZTEST(timing_nrf54, test_grtc_alloc_failure_returns_exact_error_no_setup)
{
	mock_grtc_alloc_ret = -ENOMEM;

	zassert_equal(audio_timing_init(), -ENOMEM, "exact error propagates");
	zassert_equal(mock_hal_log_len(), 1, "only the alloc attempt happens");
	zassert_equal(mock_hal_log_ev(0), EV_GRTC_ALLOC, "first event is the alloc");
	zassert_equal(mock_grtc_cc_abs_calls, 0, "no compare programmed");
	zassert_equal(mock_grtc_cc_disable_calls, 0, "nothing to disable");
	zassert_equal(mock_gppi_conn_enable_calls, 0, "no GPPI setup");
	zassert_equal(mock_timer_mode_last, -1, "no TIMER configuration");
}

/* ── 2. GPPI allocation failure cleanup ──────────────────────────── */

ZTEST(timing_nrf54, test_gppi_alloc_failure_disables_cc_then_frees_channel)
{
	mock_gppi_conn_alloc_ret = -ENOMEM;

	zassert_equal(audio_timing_init(), -ENOMEM, "exact error propagates");

	/* The GRTC compare/interrupt state enabled before the GPPI
	 * allocation must be undone through cc_disable, then the
	 * channel freed. */
	zassert_equal(mock_grtc_cc_disable_calls, 1, "cc disabled once");
	zassert_equal(mock_grtc_cc_disable_last_channel, mock_grtc_alloc_channel,
		      "disabled on the allocated channel");
	zassert_equal(mock_grtc_free_channel, mock_grtc_alloc_channel, "channel freed");

	int disable_idx = log_first(EV_GRTC_CC_DISABLE);
	int free_idx = log_first(EV_GRTC_FREE);

	zassert_true(disable_idx >= 0 && free_idx > disable_idx, "disable before free");

	/* No GPPI free occurs because the allocation never succeeded. */
	zassert_equal(mock_gppi_conn_enable_calls, 0, "no GPPI enable");
	zassert_equal(log_count(EV_GPPI_CONN_ALLOC), 1, "single alloc attempt");
}

/* ── 3. Successful init sequence, wiring, idempotence ────────────── */

ZTEST(timing_nrf54, test_init_success_sequence_and_idempotent)
{
	init_ok();

	/* GRTC: alloc → compare event enable → callback set. */
	zassert_equal(mock_hal_log_ev(0), EV_GRTC_ALLOC, "alloc first");
	zassert_equal(mock_hal_log_ev(1), EV_GRTC_COMPARE_EVENT_ENABLE, "event enabled");
	zassert_equal(mock_hal_log_a(1), mock_grtc_alloc_channel, "enabled channel");
	zassert_equal(mock_hal_log_ev(2), EV_GRTC_CALLBACK_SET, "callback registered");
	zassert_equal(mock_hal_log_a(2), mock_grtc_alloc_channel, "callback channel");
	zassert_not_null(mock_grtc_cb_handler, "handler captured");

	/* TIMER: 32-bit TIMER mode, prescaler 0, CLEAR then START. */
	zassert_equal(mock_timer_mode_last, (int)NRF_TIMER_MODE_TIMER, "TIMER mode");
	zassert_equal(mock_timer_bw_last, (int)NRF_TIMER_BIT_WIDTH_32, "32-bit");
	zassert_equal(mock_timer_prescaler_last, 0, "prescaler 0");
	int clear_idx = -1;
	int start_idx = -1;

	for (int i = 0; i < mock_hal_log_len(); i++) {
		if (mock_hal_log_ev(i) == EV_TIMER_TASK_TRIGGER &&
		    mock_hal_log_a(i) == (uint64_t)NRF_TIMER_TASK_CLEAR) {
			clear_idx = i;
		}
		if (mock_hal_log_ev(i) == EV_TIMER_TASK_TRIGGER &&
		    mock_hal_log_a(i) == (uint64_t)NRF_TIMER_TASK_START) {
			start_idx = i;
		}
	}
	zassert_true(clear_idx >= 0 && start_idx > clear_idx, "CLEAR then START");

	/* GPPI: the GRTC compare event address is routed to the TIMER
	 * CAPTURE[0] task address, then the connection is enabled.
	 * The event address encodes the allocated channel. */
	zassert_equal(mock_gppi_last_eep, mock_grtc_event_addr + mock_grtc_alloc_channel,
		      "GRTC event wired as eep");
	zassert_equal(mock_gppi_last_tep, mock_timer_task_addr, "CAPTURE task wired as tep");
	zassert_equal(mock_gppi_conn_enable_calls, 1, "GPPI enabled once");
	zassert_equal(mock_gppi_last_handle, mock_gppi_next_handle, "enabled handle");

