qarnet/le-audio-receiver/tests/unit/timing_nrf54/src/test_timing_nrf54.c
	/* Nominal base frequency captured from the HAL macro. */
	zassert_equal(mock_nrf_timer_base_frequency_hz, 16000000, "mock nominal stays 16 MHz");

	/* Idempotent: a second init does no further hardware setup. */
	zassert_equal(audio_timing_init(), 0, "second init returns 0");
	zassert_equal(log_count(EV_GRTC_ALLOC), 1, "single channel alloc");
	zassert_equal(mock_grtc_cc_abs_calls, 0, "no compare before any SDU");
	zassert_equal(mock_gppi_conn_enable_calls, 1, "no second GPPI enable");
}

/* ── 4. No-ops: update before init, zero SDU timestamp ───────────── */

ZTEST(timing_nrf54, test_update_before_init_and_zero_ts_noop)
{
	audio_timing_sdu_ref_update(100000, 20000); /* before init */
	zassert_equal(mock_grtc_cc_abs_calls, 0, "no compare before init");

	init_ok();
	audio_timing_sdu_ref_update(0, 20000); /* zero SDU timestamp */
	zassert_equal(mock_grtc_cc_abs_calls, 0, "zero ts is a no-op");
	zassert_false(audio_timing_test_is_active(), "not active");
}

/* ── 5. One anchor per session; later SDUs do not reschedule ─────── */

ZTEST(timing_nrf54, test_first_valid_ts_single_anchor_no_reschedule)
{
	init_ok();
	mock_grtc_now = 1000000ULL;

	audio_timing_sdu_ref_update(2000000, 0);
	zassert_equal(mock_grtc_cc_abs_calls, 1, "one compare");
	zassert_equal(mock_grtc_cc_abs_last_channel, mock_grtc_alloc_channel, "channel");
	zassert_equal(mock_grtc_cc_abs_last_value, 3000000ULL, "anchor + 1 s");
	zassert_true(mock_grtc_cc_abs_last_irq, "interrupt enabled");
	zassert_true(audio_timing_test_is_active(), "measurement active");

	/* Later SDUs in the same session must not reschedule. */
	audio_timing_sdu_ref_update(9000000, 0);
	zassert_equal(mock_grtc_cc_abs_calls, 1, "still one compare");
}

/* ── 6a. Future anchor schedules anchor + 1 s ────────────────────── */

ZTEST(timing_nrf54, test_first_compare_future_anchor)
{
	init_ok();
	mock_grtc_now = 1000000ULL;

	/* ts in the current epoch, ahead of now → anchor = ts,
	 * first compare = anchor + 1 s. */
	audio_timing_sdu_ref_update(3000000, 0);
	zassert_equal(mock_grtc_cc_abs_last_value, 4000000ULL, "anchor + 1 s");
}

/* ── 6b. Past first compare schedules now + 1 s ──────────────────── */

ZTEST(timing_nrf54, test_first_compare_past_schedules_now_plus_1s)
{
	init_ok();

	/* Near the 64-bit GRTC wrap the anchor + 1 s arithmetic wraps,
	 * landing in the past; the fallback must schedule now + 1 s. */
	mock_grtc_now = 0xFFFFFFFFFFFFFF00ULL;
	audio_timing_sdu_ref_update(0xFFFFFF10, 0);
	zassert_equal(mock_grtc_cc_abs_last_value, mock_grtc_now + 1000000ULL, "now + 1 s");
}

/* ── 6c. 32-bit timestamp wrap ───────────────────────────────────── */

ZTEST(timing_nrf54, test_first_compare_32bit_ts_wrap)
{
	init_ok();

	/* ts + pd wraps the 32-bit timestamp into the next epoch;
	 * the anchor expands one epoch ahead and the first compare is
	 * anchor + 1 s. */
	mock_grtc_now = 0x0000000500000030ULL;
	audio_timing_sdu_ref_update(0xFFFFFFF0, 0x20);
	zassert_equal(mock_grtc_cc_abs_last_value, 0x00000006000F4250ULL,
		      "anchor + 1 s across the epoch boundary");
}

/* ── 7. First compare callback: baseline, no feedforward ─────────── */

ZTEST(timing_nrf54, test_first_cc_callback_baseline_no_feedforward)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	/* Fire on time; TIMER captured 16,000,000 ticks. */
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL);

	zassert_equal(mock_grtc_cc_abs_calls, 2, "next compare scheduled");
	zassert_equal(mock_grtc_cc_abs_last_value, 4000000ULL, "cc + 1 s");
	zassert_equal(audio_timing_test_take_captured_work(), NULL, "baseline publishes no work");
	zassert_equal(mock_drift_ppm_count(), 0, "no feedforward on the first compare");
	zassert_true(audio_timing_test_is_active(), "measurement stays active");
}

/* ── 8. Second callback delivers exact ppm incl. TIMER32 wrap ────── */

ZTEST(timing_nrf54, test_second_cc_callback_delivers_exact_ppm_timer_wrap)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	/* Baseline capture just before the 32-bit TIMER wrap. */
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 0xFFF00000U;
	fire_cc(3000000ULL);
	zassert_equal(mock_drift_ppm_count(), 0, "baseline still silent");

	/* One second later the counter wrapped; it gained
	 * 16,000,032 ticks → exactly 2 ppm. */
	mock_grtc_now = 4000000ULL;
	mock_timer_cc_value = 0x00E42420U; /* 0xFFF00000 + 16000032 mod 2^32 */
	fire_cc(4000000ULL);

	zassert_equal(mock_grtc_cc_abs_calls, 3, "rescheduled after measurement");
	run_captured_work();
	zassert_equal(mock_drift_ppm_count(), 1, "one delivery");
	zassert_equal(mock_drift_ppm_at(0), 2, "32 ticks @ 16 MHz = 2 ppm");
}

/* ── 9. Late callback reschedules at now + 1 s ───────────────────── */

ZTEST(timing_nrf54, test_late_cc_callback_reschedules_now_plus_1s)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	/* The callback fires 2 s late: cc + 1 s is already in the
	 * past, so the next compare must be now + 1 s. */
	mock_grtc_now = 5000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL);

	zassert_equal(mock_grtc_cc_abs_calls, 2, "rescheduled");
	zassert_equal(mock_grtc_cc_abs_last_value, 6000000ULL, "now + 1 s");
}

/* ── 10. Reschedule failure: inactive, one deferred error, silence ─ */

ZTEST(timing_nrf54, test_reschedule_failure_clears_active_deferred_error_no_later_measurement)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	mock_grtc_cc_abs_ret = -ECANCELED;
	fire_cc(3000000ULL);

	zassert_false(audio_timing_test_is_active(), "active cleared on schedule failure");
	zassert_equal(mock_grtc_cc_abs_calls, 2, "anchor + one failed reschedule");

	/* One deferred error payload; running it delivers no
	 * measurement. */
	run_captured_work();
	zassert_equal(mock_drift_ppm_count(), 0, "error payload delivers no ppm");

