qarnet/le-audio-receiver/tests/unit/timing_nrf54/src/test_timing_nrf54.c
	/* Later callbacks and SDUs stay silent: inactive, and the
	 * anchor remains set. */
	zassert_equal(audio_timing_test_take_captured_work(), NULL, "no further work");
	int abs_after_failure = mock_grtc_cc_abs_calls;

	fire_cc(4000000ULL);
	zassert_equal(mock_grtc_cc_abs_calls, abs_after_failure, "no reschedule while inactive");

	audio_timing_sdu_ref_update(9000000, 0);
	zassert_equal(mock_grtc_cc_abs_calls, abs_after_failure, "no re-anchor after failure");
	zassert_equal(mock_drift_ppm_count(), 0, "no later measurement delivered");
}

/* ── 11. Reset: session cleared, compare disabled, generation bump ─ */

ZTEST(timing_nrf54, test_reset_clears_session_disables_cc_generation_permits_new_anchor)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0);
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL);
	zassert_true(audio_timing_test_is_active(), "active during session");

	uint32_t gen_before = audio_timing_test_generation();

	audio_timing_reset();
	zassert_false(audio_timing_test_is_active(), "inactive after reset");
	zassert_equal(audio_timing_test_generation(), gen_before + 1, "generation incremented");
	zassert_equal(mock_grtc_cc_disable_calls, 1, "compare disabled");
	zassert_equal(mock_grtc_cc_disable_last_channel, mock_grtc_alloc_channel,
		      "disabled on the allocated channel");

	/* One new anchor is permitted after reset. */
	int abs_before = mock_grtc_cc_abs_calls;

	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0);
	zassert_equal(mock_grtc_cc_abs_calls, abs_before + 1, "new anchor scheduled");
	zassert_true(audio_timing_test_is_active(), "new session active");
}

/* ── 12. Work captured before reset is rejected as stale ─────────── */

ZTEST(timing_nrf54, test_work_captured_before_reset_rejected_stale)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	/* Baseline compare. */
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL);

	/* Measurement compare captures work with the old generation. */
	mock_grtc_now = 4000000ULL;
	mock_timer_cc_value = 16000016;
	fire_cc(4000000ULL);
	struct k_work *stale = audio_timing_test_take_captured_work();

	zassert_not_null(stale, "work captured before reset");

	audio_timing_reset(); /* generation increments */

	zassert_equal(k_work_submit(stale), 1, "stale work queued");
	k_work_flush(stale, &work_sync);
	zassert_equal(mock_drift_ppm_count(), 0, "stale work delivers nothing");

	/* Control: a fresh session delivers again. */
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0);
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL); /* baseline */
	mock_grtc_now = 4000000ULL;
	mock_timer_cc_value = 32000016; /* +16,000,016 ticks → 1 ppm */
	fire_cc(4000000ULL);
	run_captured_work();
	zassert_equal(mock_drift_ppm_count(), 1, "fresh session delivers");
	zassert_equal(mock_drift_ppm_at(0), 1, "1 ppm");
}

/* ── 13. Every measurement reaches drift despite log pacing ──────── */

ZTEST(timing_nrf54, test_every_measurement_reaches_drift_despite_log_pacing)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	/* Baseline compare: no delivery. */
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL);
	zassert_equal(mock_drift_ppm_count(), 0, "baseline silent");

	/* Ten one-second cycles, each gaining 16,000,016 ticks (1 ppm
	 * over the 16 MHz nominal).  The diagnostic log is paced (seq 1
	 * and every 5 s), but the feedforward must be delivered for
	 * every measurement. */
	for (int i = 1; i <= 10; i++) {
		mock_grtc_now = 3000000ULL + (uint64_t)i * 1000000ULL;
		mock_timer_cc_value = 16000000U + (uint32_t)i * 16000016U;
		fire_cc(mock_grtc_now);
		run_captured_work();
		zassert_equal(mock_drift_ppm_count(), i, "delivery %d", i);
		zassert_equal(mock_drift_ppm_at(i - 1), 1, "exact ppm for cycle %d", i);
	}
}

/* ── 14. Backlog: one work invocation drains the FIFO in order ───── */

ZTEST(timing_nrf54, test_backlog_fifo_preserves_order)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	/* Baseline compare. */
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL);

	/* Ten measurement callbacks with NO work dispatch between them:
	 * Zephyr may coalesce submissions while the work item is
	 * pending, so every payload must queue and be delivered from
	 * one work invocation, in FIFO order.  Payload i carries i ppm
	 * so order is provable. */
	uint32_t cap = 16000000U;

	for (int i = 1; i <= 10; i++) {
		cap += 16000000U + (uint32_t)i * 16U; /* delta → i ppm */
		mock_grtc_now = 3000000ULL + (uint64_t)i * 1000000ULL;
		mock_timer_cc_value = cap;
		fire_cc(mock_grtc_now);
	}
	zassert_equal(mock_drift_ppm_count(), 0, "nothing delivered before dispatch");

	run_captured_work();

	zassert_equal(mock_drift_ppm_count(), 10, "all ten payloads delivered");
	for (int i = 0; i < 10; i++) {
		zassert_equal(mock_drift_ppm_at(i), i + 1, "payload %d in FIFO order", i);
	}
	zassert_true(audio_timing_test_is_active(), "session still active after drain");
}

/* ── 15. Stale and fresh payloads mix in one FIFO ────────────────── */

ZTEST(timing_nrf54, test_stale_then_fresh_mixed_generations_deliver)
{
	init_ok();
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0); /* first_cmp = 3 s */

	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL); /* baseline (gen 0) */

	/* Queue three gen-0 measurements without dispatch. */
	for (int i = 1; i <= 3; i++) {
		mock_grtc_now = 3000000ULL + (uint64_t)i * 1000000ULL;
		mock_timer_cc_value = 16000000U + (uint32_t)i * 16000016U;
		fire_cc(mock_grtc_now);
	}
	zassert_equal(mock_drift_ppm_count(), 0, "queued but not delivered");

	/* Reset does NOT rewrite queued payloads; generation bumps. */
	audio_timing_reset();
	zassert_equal(audio_timing_test_generation(), 1, "generation bumped");

	/* New session queues a fresh gen-1 measurement. */
	mock_grtc_now = 1000000ULL;
	audio_timing_sdu_ref_update(2000000, 0);
	mock_grtc_now = 3000000ULL;
	mock_timer_cc_value = 16000000;
	fire_cc(3000000ULL); /* new-session baseline */

	mock_grtc_now = 4000000ULL;
	mock_timer_cc_value = 32000016; /* +16,000,016 ticks → 1 ppm */
	fire_cc(4000000ULL);

	/* One dispatch: stale gen-0 payloads rejected independently,
	 * fresh gen-1 payload delivered. */
	run_captured_work();

	zassert_equal(mock_drift_ppm_count(), 1, "only the fresh payload delivers");
	zassert_equal(mock_drift_ppm_at(0), 1, "fresh payload value");
}

